** Helper to create better navbar
#+begin_src emacs-lisp
(garid/get-html-url-from-org-path (denote-get-path-by-id "20240814T122254"))
#+end_src

#+RESULTS:
: 20240814T122254--70-acknowledgements__future.html

